/* Գրել ծրագիր, որը առաջարկում է օգտատիրոջը գուշակել 1-ից 5 միջակայքում ընկած թիվը։ Թիվը նախօրոք  գրված է ծրագրի մեջ։
Եթե թիվը միջակայքից դուրս է
արտածվում է “Ներմուծված թիվը միջակայքից դուրս է”
արտածվում է “Փորձեք նորից”
կրկին ցուցադրվում է ներմուծման պատուհանը
Եթե օգտատերը չի գտնում թիվը,  նույնպես պիտի տեսնի հաղորդագրություն «չգուշակեցիր» և նորից ներմուծման պատուհան։ */

let number1;
let m = 3
function prom(x){
	--x;
	console.log(x);
	if (x>= 1) {

	number1 = parseInt(prompt("Գուշակիր 1-ից 5 միջակայքում ընկած թիվը", 0)); 
	}else{
		alert("game over")
	}
}
function prom2(){
alert("Ներմուծված թիվը միջակայքից դուրս է, Փորձեք նորից");
prom();
}
do{
 prom(m);
 if(Math.sign(number1) == 1 && number1 <=5){
	 alert("չգուշակեցիր");
	 prom(m);
 }else{
	prom2()
 }

}while(number1 != 2)
	 alert("ok");

