let arr = [3, 5, 6, 14, 2, 8];
/*տպել զանգվածի 2֊րդ անդամը*/
console.log(arr[1]);

/*տպել զանգվածի 2֊րդ և 4֊րդ անդամների գումարը*/
let sum = arr[1] + arr[3];
console.log(sum);
/*տպել զանգվածի վերջին 5 Էլեմենտները*/
console.log(arr.slice(-5));
/*տպել զանգվածի 6֊րդ և 1֊ին անդամների բաժանման մնացորդը*/
console.log(arr[5] % arr[0]);



/*Ստեղծել զանգված , որը լցված է հայոց այբուբենի տառերի անվանումներով ՝ այբ,բեն,գիմ …*/

let arr2 = ['լյուն', 'բեն', 'այբ', 'գիմ', 'եչ', 'է', 'ըթ', 'թո', 'ինի', 'ժե', 'հո', 'ղատ', 'ճե', 'մեն', 'դա', ];

/*Արտածել  5֊րդ և 8֊րդ տառերի անունները։*/

console.log(`${arr2[4]}, ${arr2[7]}`);
/*արտածել հայոց այբուբենի տառերի անվանումները այբենական հաջորդականությամբ*/
for (let i = 0; i <= arr2.length - 1; i++) {
    for (let j = 0; j <= arr2.length - 1; j++) {
        let max;
        if (arr2[j] > arr2[j + 1]) {
            max = arr2[j + 1];
            arr2[j + 1] = arr2[j];
            arr2[j] = max;
        }
    }
}
console.log(arr2);

/*արտածել զույգ դիրքերում գնտվող տառերը*/
for (var i = 1 ; i <= arr2.length-1; i+=2) {
	console.log(`${arr2[i]}`);
}